oxidecomputer/DAPLink/source/hic_hal/nxp/lpc55xx/DAP_config.h
/** Get timestamp of Test Domain Timer.
\return Current timestamp value.
*/
__STATIC_INLINE uint32_t TIMESTAMP_GET (void) {
  return (DWT->CYCCNT) / (CPU_CLOCK / TIMESTAMP_CLOCK);
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Initialization_gr CMSIS-DAP Initialization
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware I/O and LED Pins are initialized with the function \ref DAP_SETUP.
*/

/** Setup of the Debug Unit I/O pins and LEDs (called when Debug Unit is initialized).
This function performs the initialization of the CMSIS-DAP Hardware I/O Pins and the
Status LEDs. In detail the operation of Hardware I/O and LED pins are enabled and set:
 - I/O clock system enabled.
 - all I/O pins: input buffer enabled, output pins are set to HighZ mode.
 - for nTRST, nRESET a weak pull-up (if available) is enabled.
 - LED output pins are enabled and LEDs are turned off.
*/
__STATIC_INLINE void DAP_SETUP(void)
{
    // Configure pins.
    static const iocon_group_t kPinConfigs[] = {
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_TCK_SWCLK,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_FAST
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_TMS_SWDIO,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_FAST
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_TMS_SWDIO_TXEN,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_TDO_SWO,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SWD_EN_PORT,
            .pin = PIN_SWD_EN,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_RESET,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
                      | IOCON_GPIO_MODE // I2C pins are special
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_RESET_IN,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
                      | IOCON_GPIO_MODE // I2C pins are special
        },
        {
            .port = PIN_SPI_CS_L_PORT,
            .pin = PIN_SPI_CS_L,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_CRESET_PORT,
            .pin = PIN_SPI_CRESET,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_CDONE_PORT,
            .pin = PIN_SPI_CDONE,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_SCK_PORT,
            .pin = PIN_SPI_SCK,
            .modefunc = IOCON_FUNC7
                      | IOCON_SLEW_FAST
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_MOSI_PORT,
            .pin = PIN_SPI_MOSI,
            .modefunc = IOCON_FUNC7
                      | IOCON_SLEW_FAST
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_MISO_PORT,
            .pin = PIN_SPI_MISO,
            .modefunc = IOCON_FUNC7
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_UART_STATUS_LED_PORT,
            .pin = PIN_UART_STATUS_LED,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SWD_STATUS_LED_PORT,
            .pin = PIN_SWD_STATUS_LED,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_UC_STATUS_LED_PORT,
            .pin = PIN_UC_STATUS_LED,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
    };

    IOCON_SetPinMuxing(IOCON, kPinConfigs, ARRAY_SIZE(kPinConfigs));

    // Configure GPIO outputs.
    // set high
    GPIO->SET[PIN_PIO_PORT] = PIN_SPI_CS_L_MASK
                            | PIN_UART_EN_MASK
                            | PIN_SPI_CRESET_MASK;

    // set low
    GPIO->CLR[PIN_PIO_PORT] = PIN_SWD_EN_MASK
                            | PIN_SPI_EN_MASK
                            | PIN_RESET_MASK
                            | PIN_TMS_SWDIO_TXEN_MASK;

    // Set GPIO directions.
    // TODO cleanup port assumption

    // set outputs
    GPIO->DIRSET[PIN_PIO_PORT] = PIN_SPI_CRESET_MASK
                               | PIN_SPI_CS_L_MASK
                               | PIN_SWD_EN_MASK
                               | PIN_UART_EN_MASK
                               | PIN_SPI_EN_MASK
                               | PIN_RESET_MASK
                               | PIN_TMS_SWDIO_TXEN_MASK
                               | PIN_SWD_STATUS_LED_MASK
                               | PIN_UART_STATUS_LED_MASK
                               | PIN_UC_STATUS_LED_MASK;

    // set inputs
    GPIO->DIRCLR[PIN_PIO_PORT] = PIN_SPI_CDONE_MASK
                               | PIN_RESET_IN_MASK
                               | PIN_TMS_SWDIO_MASK;

    spi_master_config_t userConfig;
    userConfig.baudRate_Bps = 1000000;

    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM7);
    SPI_MasterGetDefaultConfig(&userConfig);
    SPI_MasterInit(SPI7, &userConfig, 12000000);
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
__STATIC_INLINE uint32_t RESET_TARGET(void)
{
    return (0);              // change to '1' when a device reset sequence is implemented
}

///@}


#endif /* __DAP_CONFIG_H__ */
